class TermsItem {
  final String title;
  final String body;

  const TermsItem({required this.title, required this.body});
}

//노션생기면노션에서불러오게할부분임
class TermsViewModel {
  TermsViewModel();

  List<TermsItem> termsContent = const [
    TermsItem(
      title: '서비스 이용약관',
      body:
          '서비스 이용약관입니다.\n노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션\n\n서비스 이용약관입니다.\n서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.서비스 이용약관입니다.',
    ),
    TermsItem(
      title: '개인정보 처리방침',
      body:
          '개인정보 처리방침입니다.\n노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션노션\n\n개인정보 처리방침입니다.\n개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.개인정보 처리방침입니다.',
    ),
  ];
}
